hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_audio/usb_dev_audio.c
//*****************************************************************************
//
// usb_dev_audio.c - Main routines for audio device example.
//
// Copyright (c) 2008-2010 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 6594 of the DK-LM3S9B96 Firmware Package.
//
//*****************************************************************************

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_udma.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/udma.h"
#include "grlib/grlib.h"
#include "usblib/usblib.h"
#include "usblib/usb-ids.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdaudio.h"
#include "utils/ustdlib.h"
#include "drivers/kitronix320x240x16_ssd2119_8bit.h"
#include "drivers/sound.h"
#include "drivers/set_pinout.h"
#include "usb_audio_structs.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>USB Audio Device (usb_dev_audio)</h1>
//!
//! This example application makes the evaluation board a USB audio device
//! that supports a single 16 bit stereo audio stream at 48 kHz sample rate.
//! The application can also receive volume control and mute changes and apply
//! them to the sound driver.  These changes will only affect the headphone
//! output and not the line output because the audio DAC used on this board
//! only allows volume changes to the headphones.
//!
//! The USB audio device example will work on any operating system that
//! supports USB audio class devices natively.  There should be no addition
//! operating system specific drivers required to use the example.   The
//! application's main task is to pass buffers to the  the USB library's audio
//! device class, receive them back with audio data and pass the buffers on to
//! the sound driver for this board.
//
//*****************************************************************************

//*****************************************************************************
//
// These defines are used to define the screen constraints to the application.
//
//*****************************************************************************
#define DISPLAY_STATUS_TEXT_POSY                                              \
    ((GrContextDpyHeightGet(&g_sContext) - DISPLAY_BANNER_HEIGHT - 1 + 8))
#define DISPLAY_STATUS_MUTE_TEXT    36
#define DISPLAY_STATUS_MUTE_INSET   4
#define DISPLAY_BANNER_HEIGHT       24
#define DISPLAY_BANNER_BG           ClrDarkBlue
#define DISPLAY_TEXT_FG             ClrWhite
#define DISPLAY_TEXT_BG             ClrBlack
#define DISPLAY_MUTE_BG             ClrRed

//******************************************************************************
//
// The DMA control structure table.
//
//******************************************************************************
#ifdef ewarm
#pragma data_alignment=1024
tDMAControlTable sDMAControlTable[64];
#elif defined(ccs)
#pragma DATA_ALIGN(sDMAControlTable, 1024)
tDMAControlTable sDMAControlTable[64];
#else
tDMAControlTable sDMAControlTable[64] __attribute__ ((aligned(1024)));
#endif

//******************************************************************************
//
// Buffer management and flags.
//
//******************************************************************************
#define AUDIO_PACKET_SIZE       ((48000*4)/1000)
#define AUDIO_BUFFER_SIZE       (AUDIO_PACKET_SIZE*20)

#define SBUFFER_FLAGS_PLAYING   0x00000001
#define SBUFFER_FLAGS_FILLING   0x00000002
struct
{
    //
    // The main buffer used by both the USB audio class and the sound driver.
    //
    volatile unsigned char pucBuffer[AUDIO_BUFFER_SIZE];

    //
    // The current location of the play pointer.
    //
    volatile unsigned char *pucPlay;

    //
    // The current location of the USB fill pointer.
    //
    volatile unsigned char *pucFill;

    //
    // The amount of sample rate adjustment currently in affect.  This value
    // can only be +1, 0, or -1.
    //
    volatile int iAdjust;

    //
    // Saves the play state for e
    volatile unsigned long ulFlags;
} g_sBuffer;

//*****************************************************************************
//
// This macro is used to convert the 16 bit signed 8.8 fixed point number to
// a number that ranges from 0 - 100.
//
//*****************************************************************************
#define CONVERT_TO_PERCENT(dbVolume)                                          \
    ((dbVolume - (short)VOLUME_MAX + (short)VOLUME_MIN) * 100) /              \
    ((short)VOLUME_MAX - (short)VOLUME_MIN) + 100;

//*****************************************************************************
//
// The current volume setting.
//
//*****************************************************************************
short g_sVolume;

//*****************************************************************************
//
// The instance data for the audio device.  This holds the value returned from
// USBDAudioInit() so that it can be passed to other Audio APIs.
//
//*****************************************************************************
void *g_pvAudioDevice;

//
// A volume update is pending.
//
#define FLAG_VOLUME_UPDATE      0x00000001

//
// A mute update is pending.
//
#define FLAG_MUTE_UPDATE        0x00000002

//
// The current state of the mute flag.
//
#define FLAG_MUTED              0x00000004

//
// A flag used to indicate whether or not we are currently connected to the USB
// host.
//
#define FLAG_CONNECTED          0x00000008
volatile unsigned long g_ulFlags;

//*****************************************************************************
//
// Graphics context used to show text on the color STN display.
//
//*****************************************************************************
tContext g_sContext;

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, unsigned long ulLine)
{
}
#endif

//*****************************************************************************
//
// This function is used to modify the MCLK used by the I2S interface by a
// given amount.
//
// \param iMClkAdjust is the amount to shift the MCLK divisor expressed as a
// signed 8.4 fixed point number.
//
// This function can be used to make adjustments to the current playback rate
// for the I2S interface without stopping playback.  The adjustment is
// specified in the \e iMClkAdjust parameter and is an 8.4 signed fixed point
// number.  Some care should be used as only small changes should be made to
// prevent noise that may occur due to a rapid change in rate.  This is not
// meant to be a sample rate conversion, it is used to correct for small errors
// in sample rate.
//
// \return None.
//
//*****************************************************************************
void
SysCtlI2SMClkAdjust(int iMClkAdjust)
{
    unsigned long ulCurrentSetting;
    int iCurrentDivisor;

    //
    // Get the current setting for mclk divisors.
    //
    ulCurrentSetting = HWREG(SYSCTL_I2SMCLKCFG);

    //
    // Adjust the clock setting.
    //
    iCurrentDivisor = (SYSCTL_I2SMCLKCFG_TXI_M | SYSCTL_I2SMCLKCFG_TXF_M) &
                       ulCurrentSetting;
    iCurrentDivisor += iMClkAdjust;

    //
    // Clear out the previous settings for the transmit divisor.
    //
    ulCurrentSetting &= ~(SYSCTL_I2SMCLKCFG_TXI_M | SYSCTL_I2SMCLKCFG_TXF_M |
                          SYSCTL_I2SMCLKCFG_RXI_M | SYSCTL_I2SMCLKCFG_RXF_M);

    //
    // Add in the new transmit divisor and save it to the register.
    //
    HWREG(SYSCTL_I2SMCLKCFG) = ulCurrentSetting |
                               (unsigned long)iCurrentDivisor |
                               ((unsigned long)iCurrentDivisor <<
                                SYSCTL_I2SMCLKCFG_RXF_S);
}

//*****************************************************************************
//
// This function is called back for events in the USB Audio Class.
//
//*****************************************************************************
unsigned long
AudioMessageHandler(void *pvCBData, unsigned long ulEvent,
                    unsigned long ulMsgParam, void *pvMsgData)
{
    switch(ulEvent)
    {
        //
        // Either the idle or active state indicates that the USB device
        // has been connected.
        //
        case USBD_AUDIO_EVENT_IDLE:
        case USBD_AUDIO_EVENT_ACTIVE:
        {
            //
            // Now connected.
            //
            g_ulFlags |= FLAG_CONNECTED;
            break;
        }


        //
        // Mute update.
        //
        case USBD_AUDIO_EVENT_MUTE:
        {
            //
            // Check if this was a mute or unmute.
            //
            if(ulMsgParam == 1)
            {
                //
                // Flag the update as a mute.
                //
                g_ulFlags |= FLAG_MUTE_UPDATE | FLAG_MUTED;
            }
            else
            {
                //
                // Flag the update as an unmute.
                //
                g_ulFlags &= ~(FLAG_MUTE_UPDATE | FLAG_MUTED);
                g_ulFlags |= FLAG_MUTE_UPDATE;
            }
            break;
        }

        //
        // Volume update.
        //
        case USBD_AUDIO_EVENT_VOLUME:
        {
            g_ulFlags |= FLAG_VOLUME_UPDATE;

            //
            // Chek for the special case of maximum attenuation.
            //
            if(ulMsgParam == 0x8000)
            {
                //
                // Set the volume to 0.
                //
                g_sVolume = 0;
            }
            else
            {
                //
                // Bias the setting to all positive values.
                //
                g_sVolume = (short)ulMsgParam - (short)VOLUME_MIN;
            }
            break;
        }

        //
        // Handle the disconnect state.
        //
        case USB_EVENT_DISCONNECTED:
        {
            //
            // No longer connected.
            //
            g_ulFlags &= ~FLAG_CONNECTED;
        }
        default:
        {
            break;
        }
    }
    return(0);
}

