hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_audio/usb_dev_audio.c
//******************************************************************************
//
// Handler for buffers being released by the sound driver.
//
//******************************************************************************
void
SoundBufferCallback(void *pvBuffer, unsigned long ulEvent)
{
    if(ulEvent & BUFFER_EVENT_FREE)
    {
        //
        // Increment the play buffer.
        //
        g_sBuffer.pucPlay += AUDIO_PACKET_SIZE;

        //
        // Wrap the play buffer back to the beginning.
        //
        if((g_sBuffer.pucPlay - g_sBuffer.pucBuffer) == AUDIO_BUFFER_SIZE)
        {
            g_sBuffer.pucPlay = g_sBuffer.pucBuffer;
        }

        //
        // If the buffers ever match then its time to stop playing and reset
        // the state.
        //
        if(g_sBuffer.pucPlay == g_sBuffer.pucFill)
        {
            g_sBuffer.ulFlags &= ~SBUFFER_FLAGS_PLAYING;
            g_sBuffer.pucPlay = g_sBuffer.pucBuffer;
            g_sBuffer.pucFill = g_sBuffer.pucBuffer;
            g_sBuffer.iAdjust = 0;

        }
        else
        {
            //
            // Start playing the next buffer.
            //
            SoundBufferPlay((void *)g_sBuffer.pucPlay, AUDIO_PACKET_SIZE,
                            SoundBufferCallback);
        }
    }
}

//******************************************************************************
//
// Handler for buffers coming from the USB audio device class.
//
//******************************************************************************
void
USBBufferCallback(void *pvBuffer, unsigned long ulParam, unsigned long ulEvent)
{
    //
    // Increment the fill pointer.
    //
    g_sBuffer.pucFill += AUDIO_PACKET_SIZE;

    //
    // At the mid point of the fill buffer check for sample rate drift.
    //
    if((g_sBuffer.pucFill - g_sBuffer.pucBuffer) == (AUDIO_BUFFER_SIZE >> 1))
    {
        //
        // See if we are running slow or fast.
        //
        if(g_sBuffer.pucPlay > g_sBuffer.pucFill)
        {
            //
            // See if the play buffer has fallen behind enough to trigger
            // adjusting the sample rate.
            //
            if((g_sBuffer.pucBuffer + AUDIO_BUFFER_SIZE -
                (AUDIO_PACKET_SIZE * 2)) < g_sBuffer.pucPlay)
            {
                //
                // Only allow an adjustment of at most one fractional bit.
                //
                if(g_sBuffer.iAdjust >= 0)
                {
                    //
                    // Adjust the sample rate down slightly
                    //
                    SysCtlI2SMClkAdjust(-1);
                    g_sBuffer.iAdjust--;
                }
            }
        }
        else
        {
            //
            // See if the play buffer has started leading by enough to trigger
            // adjusting the sample rate.
            //
            if((g_sBuffer.pucBuffer + (AUDIO_PACKET_SIZE * 2)) <
               g_sBuffer.pucPlay)
            {
                //
                // Only allow an adjustment of at most one fractional bit.
                //
                if(g_sBuffer.iAdjust <= 0)
                {
                    //
                    // Adjust the sample rate up slightly
                    //
                    SysCtlI2SMClkAdjust(1);
                    g_sBuffer.iAdjust++;
                }
            }
        }

        //
        // See if the device is currently playing.
        //
        if((g_sBuffer.ulFlags & SBUFFER_FLAGS_PLAYING) == 0)
        {
            //
            // Start playing at the current play pointer.
            //
            g_sBuffer.ulFlags |= SBUFFER_FLAGS_PLAYING;

            SoundBufferPlay((unsigned char *)g_sBuffer.pucPlay,
                            AUDIO_PACKET_SIZE, SoundBufferCallback);
        }
    }

    //
    // Wrap the buffer back to the beginning.
    //
    if((g_sBuffer.pucFill - g_sBuffer.pucBuffer) == AUDIO_BUFFER_SIZE)
    {
        g_sBuffer.pucFill = g_sBuffer.pucBuffer;
    }

    //
    // Allow the USB audio class to fill the next buffer.
    //
    USBAudioBufferOut(g_pvAudioDevice, (unsigned char *)g_sBuffer.pucFill,
                      AUDIO_PACKET_SIZE, USBBufferCallback);
}

//*****************************************************************************
//
// This function updates the mute area of the status bar.
//
//*****************************************************************************
void
UpdateMute(void)
{
    tRectangle sRect;
    short sVolume;

    //
    // Set the bounds of the mute rectangle.
    //
    sRect.sXMin = GrContextDpyWidthGet(&g_sContext) - DISPLAY_STATUS_MUTE_TEXT -
                  DISPLAY_STATUS_MUTE_INSET;

    sRect.sYMin = GrContextDpyHeightGet(&g_sContext) -
                  DISPLAY_BANNER_HEIGHT - 1 + DISPLAY_STATUS_MUTE_INSET;

    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) -
                  DISPLAY_STATUS_MUTE_INSET;

    sRect.sYMax = sRect.sYMin + DISPLAY_BANNER_HEIGHT -
                  (2 * DISPLAY_STATUS_MUTE_INSET);

    //
    // See if the current state is muted or not.
    //
    if(g_ulFlags & FLAG_MUTED)
    {
        //
        // Set the volume to 0.
        //
        SoundVolumeSet(0);

        //
        // Draw the mute background rectangle.
        //
        GrContextForegroundSet(&g_sContext, DISPLAY_MUTE_BG);
        GrRectFill(&g_sContext, &sRect);

        //
        // Reset the text color and draw the muted text.
        //
        GrContextForegroundSet(&g_sContext, DISPLAY_TEXT_FG);

        GrStringDraw(&g_sContext, "Muted", -1,
                     GrContextDpyWidthGet(&g_sContext) -
                     DISPLAY_STATUS_MUTE_TEXT,
                     DISPLAY_STATUS_TEXT_POSY, 0);
    }
    else
    {
        //
        // Reset the volume to previous setting.
        //
        sVolume = CONVERT_TO_PERCENT(g_sVolume);
        SoundVolumeSet(sVolume);

        //
        // Draw over the mute status area with the banner background.
        //
        GrContextForegroundSet(&g_sContext, DISPLAY_BANNER_BG);
        GrRectFill(&g_sContext, &sRect);

        //
        // Reset the text color.
        //
        GrContextForegroundSet(&g_sContext, DISPLAY_TEXT_FG);
    }
}

//*****************************************************************************
//
// This function updates the volume as well as the volume status bar.
//
//*****************************************************************************
void
UpdateVolume(void)
{
    char cString[12];
    short sVolume;

    //
    // Get the current volume in percentage.
    //
    sVolume = CONVERT_TO_PERCENT(g_sVolume);

    //
    // Create the volume string.
    //
    usprintf(cString, "Volume:%3d%%", sVolume);

    //
    // Update the volume string.
    //
    GrStringDraw(&g_sContext, cString, -1, 120,
                 DISPLAY_STATUS_TEXT_POSY, 1);

    //
    // Don't update the actual volume if muted.
    //
    if((g_ulFlags & FLAG_MUTED) == 0)
    {
        //
        // Set the volume to the current setting.
        //
        SoundVolumeSet(sVolume);
    }
}

//*****************************************************************************
//
// This function updates the status area of the screen.  It uses the current
// state of the application to print the status bar.
//
//*****************************************************************************
void
UpdateStatus(void)
{
    tRectangle sRect;

    //
    // Fill the bottom rows of the screen with blue to create the status area.
    //
    sRect.sXMin = 0;
    sRect.sYMin = GrContextDpyHeightGet(&g_sContext) -
                  DISPLAY_BANNER_HEIGHT - 1;
    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRect.sYMax = sRect.sYMin + DISPLAY_BANNER_HEIGHT;

    GrContextForegroundSet(&g_sContext, DISPLAY_BANNER_BG);
    GrRectFill(&g_sContext, &sRect);

    //
    // Put a white box around the banner.
    //
    GrContextForegroundSet(&g_sContext, DISPLAY_TEXT_FG);
    GrRectDraw(&g_sContext, &sRect);

    //
    // Put the application name in the middle of the banner.
    //
    GrContextFontSet(&g_sContext, &g_sFontFixed6x8);

