hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/usb_dev_audio/usb_dev_audio.c
    GrContextBackgroundSet(&g_sContext, DISPLAY_BANNER_BG);

    //
    // Update the status on the screen.
    //
    if(g_ulFlags & FLAG_CONNECTED)
    {
        //
        // Device is currently connected.
        //
        GrStringDraw(&g_sContext, "Connected", -1, 4, DISPLAY_STATUS_TEXT_POSY,
                     0);

        //
        // Update the current mute setting.
        //
        UpdateMute();

        //
        // Update the current volume setting.
        //
        UpdateVolume();
    }
    else
    {
        //
        // Keyboard is currently disconnected.
        //
        GrStringDraw(&g_sContext, "Disconnected", -1, 4, sRect.sYMin + 8, 0);
    }
}

//*****************************************************************************
//
// This is the main loop that runs the application.
//
//*****************************************************************************
int
main(void)
{
    tRectangle sRect;

    //
    // Set the clocking to run directly from the crystal.
    //
    SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                   SYSCTL_XTAL_16MHZ);

    //
    // Set the device pin out appropriately for this board.
    //
    PinoutSet();

    //
    // Configure and enable uDMA
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    SysCtlDelay(10);
    uDMAControlBaseSet(&sDMAControlTable[0]);
    uDMAEnable();

    //
    // Initialize the display driver.
    //
    Kitronix320x240x16_SSD2119Init();

    //
    // Initialize the graphics context.
    //
    GrContextInit(&g_sContext, &g_sKitronix320x240x16_SSD2119);

    //
    // Fill the top 24 rows of the screen with blue to create the banner.
    //
    sRect.sXMin = 0;
    sRect.sYMin = 0;
    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRect.sYMax = DISPLAY_BANNER_HEIGHT - 1;
    GrContextForegroundSet(&g_sContext, DISPLAY_BANNER_BG);
    GrRectFill(&g_sContext, &sRect);

    //
    // Put a white box around the banner.
    //
    GrContextForegroundSet(&g_sContext, ClrWhite);
    GrRectDraw(&g_sContext, &sRect);

    //
    // Put the application name in the middle of the banner.
    //
    GrContextForegroundSet(&g_sContext, DISPLAY_TEXT_FG);
    GrContextFontSet(&g_sContext, &g_sFontCm20);
    GrStringDrawCentered(&g_sContext, "usb-dev-audio", -1,
                         GrContextDpyWidthGet(&g_sContext) / 2, 10, 0);

    //
    // Initialize to nothing set.
    //
    g_ulFlags = 0;

    //
    // Pass the USB library our device information, initialize the USB
    // controller and connect the device to the bus.
    //
    g_pvAudioDevice = USBDAudioInit(0, (tUSBDAudioDevice *)&g_sAudioDevice);

    //
    // Configure the I2S peripheral.
    //
    SoundInit(0);

    //
    // Set the format of the playback in the sound driver.
    //
    SoundSetFormat(48000, 16, 2);

    //
    // Must disable I2S interrupts during this time to prevent state
    // problems.
    //
    IntEnable(INT_I2S0);

    //
    // Update the status bar.
    //
    UpdateStatus();

    //
    // Drop into the main loop.
    //
    while(1)
    {
        //
        // Wait for USB configuration to complete.
        //
        while((g_ulFlags & FLAG_CONNECTED) == 0)
        {
        }

        //
        // Update the status bar.
        //
        UpdateStatus();

        //
        // Initialize the buffer.
        //
        g_sBuffer.pucFill = g_sBuffer.pucBuffer;
        g_sBuffer.pucPlay = g_sBuffer.pucBuffer;
        g_sBuffer.ulFlags = 0;

        if(USBAudioBufferOut(g_pvAudioDevice,
                             (unsigned char *)g_sBuffer.pucFill,
                             AUDIO_PACKET_SIZE, USBBufferCallback) == 0)
        {
            //
            // Now filling data.
            //
            g_sBuffer.ulFlags |= SBUFFER_FLAGS_FILLING;
        }

        //
        // Now keep processing as long as the host is connected.
        //
        while(g_ulFlags & FLAG_CONNECTED)
        {
            //
            // Check if there was a volume update.
            //
            if(g_ulFlags & FLAG_VOLUME_UPDATE)
            {
                //
                // Clear the volume update flag.
                //
                g_ulFlags &= ~FLAG_VOLUME_UPDATE;

                //
                // Update the current volume.
                //
                UpdateVolume();
            }

            //
            // Check if there was a mute update.
            //
            if(g_ulFlags & FLAG_MUTE_UPDATE)
            {
                //
                // Update the current mute setting.
                //
                UpdateMute();

                //
                // Clear both mute flags.
                //
                g_ulFlags &= ~FLAG_MUTE_UPDATE;
            }
        }

        //
        // Update the status bar now that a disconnect has occurred.
        //
        UpdateStatus();
    }
}

